//1.1 Напишите программу по согласованию отпуска в зависимости от месяца. Если месяц “July” или “August”, 
//то программа должна показать - ‘approved’, если другие месяцы, то - “denied”.

let month = prompt("when do you like to go to vacation? ")
if (month === "July" || month === "August") {
    console.log("approved");
} else {
    console.log("denied");

}

//1.2 Напишите простенький калькулятор (*, /, +, -). Проверьте ваш код на охват исключений для арифметических операций.
//У вас должны быть две переменные для исходных чисел и одна для оператора. В зависимости от оператора, должно происходить то или
// иное арифметическое действие и выводиться результат в консоль.

let num1;
let num2;
let operation = prompt()
if ()


