/*





Задачка посложнее* 
 Придумайте свой собственный шифр, а также программу, которая будет шифровать и затем дешифровщик к нему

Домашнее задание от Татьяны Волк


Нарисовать елочку и ромб  с помощью циклов 


*/
/*При помощи цикла for выведите чётные числа от 2 до 10*/
for (let i = 2; i <= 10; i++) {
    if (i % 2 == 0) {
        console.log(i)
    }
}

/*Задача с интервью
У вас есть массив со скобками, предположим  [ ‘(‘, ‘)’, ‘(‘, ‘)’, ‘)’]
. Количество элементов и последовательность может быть разной.
Нужно выяснить, у каждой ли скобки есть соответствующая пара (открывающая и закрывающая).*/
// let arr = [];
// for (let i = 0; i < arr.length; i++) {
//     if ()
// }

// Креативное задание*(не показываем решение до понедельника):
// Имеется зашифрованное предложение
// “Ybrobrubr brabrrbrebr brtbrhbrebr brbbrebrsbrtbr brQbrAbr brebrvbrebrrbr”
// мы знаем, что оно означает “You are the best QA ever”.
// Нам нужно придумать программу дешифратор.


